areiter128/SMPS-MCAL-PLIB/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_hspwm_c.c
/*LICENSE *****************************************************************************************
 *
 * Software License Agreement
 *
 * Copyright (R) 2012 Microchip Technology Inc.  All rights reserved. Microchip licenses to you the
 * right to use, modify, copy and distribute Software only when embedded on a Microchip 
 * microcontroller or digital signal controller, which is integrated into your product or third 
 * party product (pursuant to the sublicense terms in the accompanying license agreement).
 *
 * You should refer to the license agreement accompanying this Software for additional information 
 * regarding your rights and obligations.
 *
 * SOFTWARE AND DOCUMENTATION ARE PROVIDED "AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR 
 * IMPLIED, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE, NON-INFRINGEMENT 
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE LIABLE OR
 * OBLIGATED UNDER CONTRACT, NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR 
 * OTHER LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES INCLUDING BUT NOT  
 * LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE OR CONSEQUENTIAL DAMAGES, LOST PROFITS  
 * OR LOST DATA, COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY  
 * THIRD PARTIES (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.
 *
 * ***********************************************************************************************/

// Device header file
#include <xc.h>
#include <stdint.h>
#include <stdbool.h>

#include "p33SMPS_hspwm_c.h"


/*!p33MP_hspwm.c
 * ************************************************************************************************
 * Summary:
 * Driver file for the dsPIC33CxxxMPxxx-PWM SFRs
 *
 * Description:
 * The SMPS PWM module offers a large number of registers and configuration options. This additional
 * driver file contains initialization routines for all required settings.
 * ***********************************************************************************************/

/*!hspwm_power_enable
 * ************************************************************************************************
 * Summary:
 * Enables the bias power to the high resolution PWM module
 *
 * Parameters:
 *	(none)
 * 
 * Description:
 * PICmicro controllers offer so-called PERIPHERAL MODULE DISABLE (PMD) registers turning on/off
 * the bias power to on-chip peripheral blocks. This routine enables the bias power to the high-
 * resolution PWM module.
 * ***********************************************************************************************/
inline volatile uint16_t hspwm_power_enable(void) {
// enable power to peripheral
    _HSPWM_POWER_ENABLE;
    return(1 - _PWMMD);
}

/*!hspwm_power_disable
 * ************************************************************************************************
 * Summary:
 * Disables the bias power to the high resolution PWM module
 *
 * Parameters:
 *	(none)
 * 
 * Description:
 * PICmicro controllers offer so-called PERIPHERAL MODULE DISABLE (PMD) registers turning on/off
 * the bias power to on-chip peripheral blocks. This routine disables the bias power to the high-
 * resolution PWM module.
 * ***********************************************************************************************/
inline volatile uint16_t hspwm_power_disable(void) {
// disable power to peripheral
    _HSPWM_POWER_DISABLE;
    return(1 - _PWMMD);
}

volatile uint16_t hspwm_init_pwm_module ( HSPWM_C_MODULE_CONFIG_t pwm_config ) {

    volatile uint16_t fres=1;
    volatile uint16_t *regptr16;
    volatile uint32_t *regptr32;

    // Ensure power to PWM module is ON
    if (!hspwm_power_enable()) return(0);
    
    // write register configuration
    regptr16 = (volatile uint16_t*) &PCLKCON; // Get target address
    *regptr16 = (pwm_config.PCLKCON.value & REG_PCLKCON_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_PCLKCON_VALID_DATA_READ_MASK) == (pwm_config.PCLKCON.value & REG_PCLKCON_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &FSCL; // Get target address
    *regptr16 = (pwm_config.FSCL.value & REG_FSCL_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_FSCL_VALID_DATA_READ_MASK) == (pwm_config.FSCL.value & REG_FSCL_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &FSMINPER; // Get target address
    *regptr16 = (pwm_config.FSMINPER.value & REG_FSMINPER_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_FSMINPER_VALID_DATA_READ_MASK) == (pwm_config.FSMINPER.value & REG_FSMINPER_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter
    
    // write register configuration
    regptr16 = (volatile uint16_t*) &MPHASE; // Get target address
    *regptr16 = (pwm_config.MPHASE.value & REG_MPHASE_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_MPHASE_VALID_DATA_READ_MASK) == (pwm_config.MPHASE.value & REG_MPHASE_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &MDC; // Get target address
    *regptr16 = (pwm_config.MDC.value & REG_MDC_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_MDC_VALID_DATA_READ_MASK) == (pwm_config.MDC.value & REG_MDC_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &MPER; // Get target address
    *regptr16 = (pwm_config.MPER.value & REG_MPER_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_MPER_VALID_DATA_READ_MASK) == (pwm_config.MPER.value & REG_MPER_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

