areiter128/SMPS-MCAL-PLIB/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_hspwm_c.c
    // write register configuration
    regptr16 = (volatile uint16_t*) &LFSR; // Get target address
    *regptr16 = (pwm_config.LFSR.value & REG_LFSR_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_LFSR_VALID_DATA_READ_MASK) == (pwm_config.LFSR.value & REG_LFSR_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr32 = (volatile uint32_t*) &CMBTRIGL; // Get target address
    *regptr32 = (pwm_config.CMBTRIG.value & REG_CMBTRIG_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_CMBTRIG_VALID_DATA_READ_MASK) == (pwm_config.CMBTRIG.value & REG_CMBTRIG_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &LOGCONA; // Get target address
    *regptr16 = (pwm_config.LOGCONA.value & REG_LOGCONy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_LOGCONy_VALID_DATA_READ_MASK) == (pwm_config.LOGCONA.value & REG_LOGCONy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter
    
    // write register configuration
    regptr16 = (volatile uint16_t*) &LOGCONB; // Get target address
    *regptr16 = (pwm_config.LOGCONB.value & REG_LOGCONy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_LOGCONy_VALID_DATA_READ_MASK) == (pwm_config.LOGCONB.value & REG_LOGCONy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &LOGCONC; // Get target address
    *regptr16 = (pwm_config.LOGCONC.value & REG_LOGCONy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_LOGCONy_VALID_DATA_READ_MASK) == (pwm_config.LOGCONC.value & REG_LOGCONy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter
    
    // write register configuration
    regptr16 = (volatile uint16_t*) &LOGCOND; // Get target address
    *regptr16 = (pwm_config.LOGCOND.value & REG_LOGCONy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_LOGCONy_VALID_DATA_READ_MASK) == (pwm_config.LOGCOND.value & REG_LOGCONy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter
    
    // write register configuration
    regptr16 = (volatile uint16_t*) &LOGCONE; // Get target address
    *regptr16 = (pwm_config.LOGCONE.value & REG_LOGCONy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_LOGCONy_VALID_DATA_READ_MASK) == (pwm_config.LOGCONE.value & REG_LOGCONy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter
    
    // write register configuration
    regptr16 = (volatile uint16_t*) &LOGCONF; // Get target address
    *regptr16 = (pwm_config.LOGCONF.value & REG_LOGCONy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_LOGCONy_VALID_DATA_READ_MASK) == (pwm_config.LOGCONF.value & REG_LOGCONy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter
    
    // write register configuration
    regptr16 = (volatile uint16_t*) &PWMEVTA; // Get target address
    *regptr16 = (pwm_config.PWMEVTA.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_PWMEVTy_VALID_DATA_READ_MASK) == (pwm_config.PWMEVTA.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &PWMEVTB; // Get target address
    *regptr16 = (pwm_config.PWMEVTB.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_PWMEVTy_VALID_DATA_READ_MASK) == (pwm_config.PWMEVTB.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &PWMEVTC; // Get target address
    *regptr16 = (pwm_config.PWMEVTC.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_PWMEVTy_VALID_DATA_READ_MASK) == (pwm_config.PWMEVTC.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &PWMEVTD; // Get target address
    *regptr16 = (pwm_config.PWMEVTD.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_PWMEVTy_VALID_DATA_READ_MASK) == (pwm_config.PWMEVTD.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &PWMEVTE; // Get target address
    *regptr16 = (pwm_config.PWMEVTE.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_PWMEVTy_VALID_DATA_READ_MASK) == (pwm_config.PWMEVTE.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &PWMEVTF; // Get target address
    *regptr16 = (pwm_config.PWMEVTF.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_PWMEVTy_VALID_DATA_READ_MASK) == (pwm_config.PWMEVTF.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    return(1);
}

/*!hspwm_init_independent_pwm
 * ************************************************************************************************
 * Summary:
 * Sets the basic configuration of a PWM generator 
 *
 * Parameters:
 *	(none)
 * 
 * Description:
 * This PWM instance configuration includes PWMxH/PWMxL outputs, selection of clock source and dividers,
 * dead times and events. Each instance configuration disables the instance by default. the PWM instance 
 * needs to be enabled by using the function call "hspwm_enable_pwm(instance)".
 * ***********************************************************************************************/

inline volatile uint16_t hspwm_init_independent_pwm(
            uint16_t instance, 
            REGBLK_PCLKCON_t regPCLK, 
            REGBLK_PGxCH_CONFIG_t regPGxCON, 
            REGBLK_PGxEVT_CONFIG_t regPGxEVT,
            REGBLK_PGxIO_CONFIG_t regPGxIOCON, 
            REGBLK_PGxDEAD_TIME_t regPGxDT
    )
{
    
    volatile uint16_t fres=1;
    volatile uint16_t *regptr16;
    volatile uint32_t *regptr32;
    volatile uint16_t reg_offset;

    // write clock configuration
    regptr16 = (volatile uint16_t*) &PCLKCON;
    *regptr16 = (regPCLK.value & REG_PCLKCON_VALID_DATA_WRITE_MASK);

    // Test if written value matches parameter
    fres &= ((*regptr16 & REG_PCLKCON_VALID_DATA_READ_MASK) == (regPCLK.value & REG_PCLKCON_VALID_DATA_WRITE_MASK));
    
    // write PWM instance configuration
    reg_offset = (instance-1) * ((volatile uint16_t)&PG2CONL - (volatile uint16_t)&PG1CONL);
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&PG1CONL + reg_offset);
    *regptr32 = (regPGxCON.value & REG_PGxCON_VALID_DATA_WRITE_MASK);

    // write PWM instance event configuration
    reg_offset = (instance-1) * ((volatile uint16_t)&PG2EVTL - (volatile uint16_t)&PG1EVTL);
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&PG1EVTL + reg_offset);
    *regptr32 = (regPGxEVT.value & REG_PGxEVT_VALID_DATA_WRITE_MASK);

    // write IO configuration
    reg_offset = (instance-1) * ((volatile uint16_t)&PG2IOCONL - (volatile uint16_t)&PG1IOCONL);
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&PG1IOCONL + reg_offset);
    *regptr32 = (regPGxIOCON.value & REG_PGxIOCON_VALID_DATA_WRITE_MASK);

    // write dead time
    reg_offset = (instance-1) * ((volatile uint16_t)&PG2DTL - (volatile uint16_t)&PG1DTL);
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&PG1DTL + reg_offset);
    *regptr32 = (regPGxDT.value & REG_PGxDT_VALID_DATA_WRITE_MASK);
    
    return(fres);

