areiter128/SMPS-MCAL-PLIB/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_hspwm_c.c
inline volatile uint16_t hspwm_ovr_release_high_side(uint16_t instance)
{
    volatile uint16_t *regptr16;
    volatile uint16_t reg_offset;
    volatile uint16_t reg_buf=0;

    reg_offset = (instance-1) * ((volatile uint16_t)&PG2IOCONL - (volatile uint16_t)&PG1IOCONL);
    regptr16 = (volatile uint16_t*) ((volatile uint8_t*)&PG1IOCONL + reg_offset);
    reg_buf = *regptr16;
    *regptr16 = reg_buf & REG_IOCON_OVRENH_RESET;
    
    return(1 - (volatile uint16_t)(volatile bool)(*regptr16 & REG_IOCON_OVRENH_ENABLED));
}

/*!hspwm_ovr_release_low_side
 * ************************************************************************************************
 * Summary:
 * Releases the low-side PWM output PWMxL of the specified PWM instance 
 *
 * Parameters:
 *	uint16_t instance:  Index of the PWM generator addressed (e.g. 1 for PWM1, 2 for PWM2, etc.)
 *
 * Returns:
 *  uint16_t            a 16-bit unsigned integer number indicating if the write process was 
 *                      executed successfully (0: failure, 1: success)
 *  
 * Description:
 * This function enables the low-side PWM output PWMxL of the PWM generator defined by 
 * parameter 'instance' by releasing them from override conditions.
 * ***********************************************************************************************/

inline volatile uint16_t hspwm_ovr_release_low_side(uint16_t instance)
{
    volatile uint16_t *regptr16;
    volatile uint16_t reg_offset;
    volatile uint16_t reg_buf=0;

    reg_offset = (instance-1) * ((volatile uint16_t)&PG2IOCONL - (volatile uint16_t)&PG1IOCONL);
    regptr16 = (volatile uint16_t*) ((volatile uint8_t*)&PG1IOCONL + reg_offset);
    reg_buf = *regptr16;
    *regptr16 = reg_buf & REG_IOCON_OVRENL_RESET;
    
    return(1 - (volatile uint16_t)(volatile bool)(*regptr16 & REG_IOCON_OVRENL_ENABLED));
}

/*!hspwm_set_gpio_high_side
 * ************************************************************************************************
 * Summary:
 * Revokes pin-ownership of output PWMxH of a PWM generator making it a GPIO
 *
 * Parameters:
 *	uint16_t instance:  Index of the PWM generator addressed (e.g. 1 for PWM1, 2 for PWM2, etc.)
 *
 * Returns:
 *  uint16_t            a 16-bit unsigned integer number indicating if the write process was 
 *                      executed successfully (0: failure, 1: success)
 *  
 * Description:
 * This function revokes the pin-ownership of output PWMxH from the specified PWM generator 
 * defined by parameter 'instance'. The output pin PWMxH becomes a general purpose IO, which 
 * can be controlled by port latch (LATx), port (PORTx) and i/o direction registers (TRIS).
 * ***********************************************************************************************/

inline volatile uint16_t hspwm_set_gpio_high_side(uint16_t instance)
{
    volatile uint16_t *regptr16;
    volatile uint16_t reg_offset;
    volatile uint16_t reg_buf=0;

    reg_offset = (instance-1) * ((volatile uint16_t)&PG2IOCONH - (volatile uint16_t)&PG1IOCONH);
    regptr16 = (volatile uint16_t*) ((volatile uint8_t*)&PG1IOCONH + reg_offset);
    reg_buf = *regptr16;
    *regptr16 = reg_buf & REG_IOCON_PENH_GPIO_ENABLE;
    
    return((volatile uint16_t)(volatile bool)(*regptr16 & REG_IOCON_PENH_GPIO_DISABLE));
}

/*!hspwm_reset_gpio_high_side
 * ************************************************************************************************
 * Summary:
 * Assigns the pin-ownership of output PWMxH to the PWM generator
 *
 * Parameters:
 *	uint16_t instance:  Index of the PWM generator addressed (e.g. 1 for PWM1, 2 for PWM2, etc.)
 *
 * Returns:
 *  uint16_t            a 16-bit unsigned integer number indicating if the write process was 
 *                      executed successfully (0: failure, 1: success)
 *  
 * Description:
 * This function assigns the pin-ownership of output PWMxH to the specified PWM generator defined by 
 * parameter 'instance'. General power control registers, such as port latch (LATx), port (PORTx) 
 * and i/o direction registers (TRIS), will have no effect on the output pin.
 * ***********************************************************************************************/
     
inline volatile uint16_t hspwm_reset_gpio_high_side(uint16_t instance)
{
    volatile uint16_t *regptr16;
    volatile uint16_t reg_offset;
    volatile uint16_t reg_buf=0;

    reg_offset = (instance-1) * ((volatile uint16_t)&PG2IOCONH - (volatile uint16_t)&PG1IOCONH);
    regptr16 = (volatile uint16_t*) ((volatile uint8_t*)&PG1IOCONH + reg_offset);
    reg_buf = *regptr16;
    *regptr16 = reg_buf | REG_IOCON_PENH_GPIO_DISABLE;
    
    return(1 - (volatile uint16_t)(volatile bool)(*regptr16 & REG_IOCON_PENH_GPIO_DISABLE));
}

/*!hspwm_set_gpio_low_side
 * ************************************************************************************************
 * Summary:
 * Revokes pin-ownership of output PWMxL of a PWM generator making it a GPIO
 *
 * Parameters:
 *	uint16_t instance:  Index of the PWM generator addressed (e.g. 1 for PWM1, 2 for PWM2, etc.)
 *
 * Returns:
 *  uint16_t            a 16-bit unsigned integer number indicating if the write process was 
 *                      executed successfully (0: failure, 1: success)
 *  
 * Description:
 * This function revokes the pin-ownership of output PWMxL from the specified PWM generator 
 * defined by parameter 'instance'. The output pin PWMxL becomes a general purpose IO, which 
 * can be controlled by port latch (LATx), port (PORTx) and i/o direction registers (TRIS).
 * ***********************************************************************************************/

inline volatile uint16_t hspwm_set_gpio_low_side(uint16_t instance)
{
    volatile uint16_t *regptr16;
    volatile uint16_t reg_offset;
    volatile uint16_t reg_buf=0;

    reg_offset = (instance-1) * ((volatile uint16_t)&PG2IOCONH - (volatile uint16_t)&PG1IOCONH);
    regptr16 = (volatile uint16_t*) ((volatile uint8_t*)&PG1IOCONH + reg_offset);
    reg_buf = *regptr16;
    *regptr16 = reg_buf & REG_IOCON_PENL_GPIO_ENABLE;
    
    return((volatile uint16_t)(volatile bool)(*regptr16 & REG_IOCON_PENL_GPIO_DISABLE));
}

/*!hspwm_reset_gpio_low_side
 * ************************************************************************************************
 * Summary:
 * Assigns the pin-ownership of output PWMxL to the PWM generator
 *
 * Parameters:
 *	uint16_t instance:  Index of the PWM generator addressed (e.g. 1 for PWM1, 2 for PWM2, etc.)
 *
 * Returns:
 *  uint16_t            a 16-bit unsigned integer number indicating if the write process was 
 *                      executed successfully (0: failure, 1: success)
 *  
 * Description:
 * This function assigns the pin-ownership of output PWMxL to the specified PWM generator defined by 
 * parameter 'instance'. General power control registers, such as port latch (LATx), port (PORTx) 
 * and i/o direction registers (TRIS), will have no effect on the output pin.
 * ***********************************************************************************************/

inline volatile uint16_t hspwm_reset_gpio_low_side(uint16_t instance)
{
    volatile uint16_t *regptr16;
    volatile uint16_t reg_offset;
    volatile uint16_t reg_buf=0;

    reg_offset = (instance-1) * ((volatile uint16_t)&PG2IOCONH - (volatile uint16_t)&PG1IOCONH);
    regptr16 = (volatile uint16_t*) ((volatile uint8_t*)&PG1IOCONH + reg_offset);
    reg_buf = *regptr16;
    *regptr16 = reg_buf | REG_IOCON_PENL_GPIO_DISABLE;
    
    return(1 - (volatile uint16_t)(volatile bool)(*regptr16 & REG_IOCON_PENL_GPIO_DISABLE));
}
/* *****************************************************************************************************
 * *****************************************************************************************************/

